Repository: lmcapacho/icestudio
Catalog: app/resources/locale/*/*.po
Languages: uk_ua

source: <b>Read only</b><br> Unlock to edit the block!
uk_ua: <b>Тільки для читання</b><br> Розблокуйте для редагування блоку!

source: <b>Unplug</b> and <b>reconnect</b> the board
uk_ua: <b>Відключіть</b> і <b>підключіть</b> плату знову

source: <b>WARNING!</b><br> The changes made here will also be applied to all the [ <b>{{ information.name }}</b> ] blocks in the current design. If you DO NOT want them to propagate, create a cloned block instead using<br> <b>Edit → Clone</b>.
uk_ua: <b>УВАГА!</b><br> Зміни, зроблені тут, будуть також застосовані до всіх блоків [<b>{{ information.name }}</b>] у поточному дизайні. Якщо ви НЕ бажаєте, щоб вони розповсюджувалися, створіть клонований блок, використовуючи<br> <b>Редагування → Клонувати</b>.

source: About Icestudio
uk_ua: Про Icestudio

source: Acknowledgment
uk_ua: Подяка

source: Add
uk_ua: Додати

source: Add a block to start
uk_ua: Додайте блок для початку

source: Add as block
uk_ua: Додати як блок

source: Address format
uk_ua: Формат адреси

source: Advanced features
uk_ua: Розширені функції

source: All collections removed
uk_ua: Всі колекції видалено

source: All stored collections will be lost. Do you want to continue?
uk_ua: Усі збережені колекції буде втрачено. Ви хочете продовжити?

source: Allow tri-state connections
uk_ua: Дозволити тристабільні з'єднання

source: Apio install drivers
uk_ua: Встановити драйвери Apio

source: Apio install {{name}}
uk_ua: Встановити {{name}} за допомогою Apio

source: At least Python 3.7 is required
uk_ua: Потрібен Python версії не нижче 3.7

source: Author
uk_ua: Автор

source: Basic
uk_ua: Основний

source: Basic Toolbox
uk_ua: Основний інструментарій

source: Basque
uk_ua: Баскська

source: Binary
uk_ua: Двійковий

source: Bitstream not found: Build your project first
uk_ua: Бітстрім не знайдено: спершу побудуйте свій проект

source: Block updated
uk_ua: Блок оновлено

source: Block {{name}} imported
uk_ua: Блок {{name}} імпортовано

source: Blocks
uk_ua: Блоки

source: Board
uk_ua: Плата

source: Board rules
uk_ua: Правила плати

source: Board rules disabled
uk_ua: Правила плати вимкнені

source: Board rules enabled
uk_ua: Правила плати ввімкнені

source: Board {{name}} disconnected
uk_ua: Плата {{name}} відключена

source: Board {{name}} not available
uk_ua: Плата {{name}} недоступна

source: Board {{name}} not connected
uk_ua: Плата {{name}} не підключена

source: Board {{name}} selected
uk_ua: Вибрана плата {{name}}

source: Bootloader not active
uk_ua: Завантажувач не активний

source: Build
uk_ua: Збірка

source: Build done
uk_ua: Збірка завершена

source: Cancel
uk_ua: Скасувати

source: Cannot paste from a different project format ({{version}})
uk_ua: Не можна вставити з іншого формату проекту ({{version}})

source: Case sensitive
uk_ua: З урахуванням регістру

source: Catalonian
uk_ua: Каталонська

source: Change Color
uk_ua: Змінити колір

source: Changed Preferences: Allow tri-state connections
uk_ua: Змінені налаштування: Дозволити тристабільні з'єднання

source: Check Internet connection...
uk_ua: Перевірте підключення до Інтернету...

source: Check Python...
uk_ua: Перевірте Python...

source: Chinese
uk_ua: Китайська

source: Choose a color:
uk_ua: Виберіть колір:

source: Click "Yes" to allow tri-state and update Preferences:<br />&nbsp;&nbsp;&nbsp;<b>Advanced features → Allow tri-state connections</b><br /><br />Click "This time" to view tri-state for this design only.
uk_ua: Натисніть "Так", щоб дозволити тристабільні з'єднання та оновити налаштування:<br />&nbsp;&nbsp;&nbsp;<b>Розширені функції → Дозволити тристабільні з'єднання</b><br /><br />Натисніть "Цього разу", щоб переглянути тристабільні з'єднання лише для цього дизайну.

source: Click here to <b>download a newer version</b> of Icestudio
uk_ua: Натисніть тут, щоб <b>завантажити новішу версію</b> Icestudio

source: Click here to <b>setup the drivers</b>
uk_ua: Натисніть тут, щоб <b>налаштувати драйвери</b>

source: Click here to install it
uk_ua: Натисніть тут, щоб встановити

source: Click here to view
uk_ua: Натисніть тут, щоб переглянути

source: Clock not allowed for data buses
uk_ua: Годинник не дозволений для шин даних

source: Clone
uk_ua: Клонувати

source: Close
uk_ua: Закрити

source: Code
uk_ua: Код

source: Collection
uk_ua: Колекція

source: Collection info
uk_ua: Інформація про колекцію

source: Collection {{collection}} info not defined
uk_ua: Інформацію про колекцію {{collection}} не визначено

source: Collection {{name}} added
uk_ua: Колекцію {{name}} додано

source: Collection {{name}} not replaced
uk_ua: Колекцію {{name}} не замінено

source: Collection {{name}} removed
uk_ua: Колекцію {{name}} видалено

source: Collection {{name}} replaced
uk_ua: Колекцію {{name}} замінено

source: Collection {{name}} selected
uk_ua: Колекцію {{name}} вибрано

source: Collections
uk_ua: Колекції

source: Command output
uk_ua: Вивід команди

source: Community forum
uk_ua: Форум спільноти

source: Configuration not completed
uk_ua: Конфігурацію не завершено

source: Constant
uk_ua: Константа

source: Constant names
uk_ua: Назви констант

source: Convert
uk_ua: Конвертувати

source: Copy
uk_ua: Копіювати

source: Coral
uk_ua: Кораловий

source: Create virtualenv...
uk_ua: Створити virtualenv...

source: Cut
uk_ua: Вирізати

source: Czech
uk_ua: Чеська

source: Dark (default)
uk_ua: Темний (за замовчуванням)

source: Dark Green
uk_ua: Темно-зелений

source: Dark Orange
uk_ua: Темно-оранжевий

source: Datasheet
uk_ua: Технічна документація

source: Decimal
uk_ua: Десятковий

source: Deep Pink
uk_ua: Насичено-рожевий

source: Deep Sky Blue
uk_ua: Насичено-блакитний

source: Default
uk_ua: За замовчуванням

source: Delete
uk_ua: Видалити

source: Description
uk_ua: Опис

source: Disable
uk_ua: Вимкнути

source: Do you want to close the application?
uk_ua: Ви хочете закрити програму?

source: Do you want to remove the {{name}} collection?
uk_ua: Ви хочете видалити колекцію {{name}}?

source: Do you want to replace it?
uk_ua: Ви хочете замінити її?

source: Documentation
uk_ua: Документація

source: Don’t display
uk_ua: Не відображати

source: Drivers
uk_ua: Драйвери

source: Drivers disabled
uk_ua: Драйвери вимкнено

source: Drivers enabled
uk_ua: Драйвери увімкнено

source: Duplicate
uk_ua: Дублювати

source: Duplicate FPGA I/O ports
uk_ua: Дублювання портів введення/виведення FPGA

source: Duplicate port name: {{name}}
uk_ua: Повторювана назва порту: {{name}}

source: Dutch
uk_ua: Голландська

source: Edit
uk_ua: Редагувати

source: Edit the collection name
uk_ua: Редагувати назву колекції

source: Enable
uk_ua: Увімкнути

source: English
uk_ua: Англійська

source: Enter the external collection path
uk_ua: Введіть шлях до зовнішньої колекції

source: Enter the external plugins path
uk_ua: Введіть шлях до зовнішніх плагінів

source: Enter the log filename
uk_ua: Введіть ім'я файлу журналу

source: Enter the pip path
uk_ua: Введіть шлях до pip

source: Enter the python path
uk_ua: Введіть шлях до python

source: Enter the remote hostname user@host
uk_ua: Введіть віддалене ім'я хоста user@host

source: Error installing driver:
uk_ua: Помилка встановлення драйвера:

source: Error: {{error}}
uk_ua: Помилка: {{error}}

source: Errors detected in the design
uk_ua: Виявлено помилки в проєкті

source: Exact match
uk_ua: Точний збіг

source: Examples
uk_ua: Приклади

source: Execute remote {{label}} ...
uk_ua: Виконати віддалено {{label}} ...

source: Export
uk_ua: Експорт

source: Export submodule
uk_ua: Експорт підмодуля

source: External collections
uk_ua: Зовнішні колекції

source: External collections updated
uk_ua: Зовнішні колекції оновлено

source: External plugins
uk_ua: Зовнішні плагіни

source: External plugins updated
uk_ua: Зовнішні плагіни оновлено

source: FPGA I/O ports not defined
uk_ua: Порти введення/виведення FPGA не визначені

source: FPGA pin
uk_ua: Пін FPGA

source: FPGA resources
uk_ua: Ресурси FPGA

source: FPGAwars community.
uk_ua: Спільнота FPGAwars.

source: File
uk_ua: Файл

source: File {{file}} already exists in the project path. Do you want to replace it?
uk_ua: Файл {{file}} вже існує в шляху проєкту. Ви хочете замінити його?

source: File {{file}} does not exist
uk_ua: Файл {{file}} не існує

source: File {{file}} imported
uk_ua: Файл {{file}} імпортовано

source: Find
uk_ua: Знайти

source: Fit content
uk_ua: Підігнати вміст

source: French
uk_ua: Французька

source: Fuchsia
uk_ua: Фуксія

source: Galician
uk_ua: Галісійська

source: German
uk_ua: Німецька

source: Gold
uk_ua: Золотий

source: Greek
uk_ua: Грецька

source: Green Yellow
uk_ua: Зелено-жовтий

source: Help
uk_ua: Допомога

source: Hexadecimal
uk_ua: Шістнадцятковий

source: Icestudio is part of
uk_ua: Icestudio є частиною

source: If you see blank IN/OUT pins, it is because equivalent pins do not exist on this board
uk_ua: Якщо ви бачите порожні контакти IN/OUT, це тому що відповідних контактів не існує на цій платі

source: Image
uk_ua: Зображення

source: Indian Red
uk_ua: Індійський червоний

source: Information
uk_ua: Інформація

source: Input
uk_ua: Вхід

source: Input label
uk_ua: Мітка входу

source: Input labels
uk_ua: Мітки входів

source: Input parameters
uk_ua: Вхідні параметри

source: Input port names
uk_ua: Назви вхідних портів

source: Input ports
uk_ua: Вхідні порти

source: Install (Stable)
uk_ua: Встановити (стабільну версію)

source: Install Development version
uk_ua: Встановити версію для розробників

source: Install the <b>STABLE Toolchain</b>. This operation requires Internet connection.<br><p><b>NOTE:</b> You need to disconnect your VPN (if any) to allow the toolchain installation</p> <p>Do you want to continue?</p>
uk_ua: Встановіть <b>СТАБІЛЬНИЙ інструментарій</b>. Ця операція вимагає підключення до Інтернету.<br><p><b>ПРИМІТКА:</b> Вам потрібно відключити VPN (якщо є) для дозволу установки інструментарію</p> <p>Ви хочете продовжити?</p>

source: Install the DEVELOPMENT toolchain. It will be downloaded. This operation requires Internet connection. Do you want to continue?
uk_ua: Встановіть інструментарій ДЛЯ РОЗРОБНИКІВ. Він буде завантажений. Ця операція вимагає підключення до Інтернету. Ви хочете продовжити?

source: Install the LATEST STABLE toolchain. It will be downloaded. This operation requires Internet connection. Do you want to continue?
uk_ua: Встановіть ОСТАННІЙ СТАБІЛЬНИЙ інструментарій. Він буде завантажений. Ця операція вимагає підключення до Інтернету. Ви хочете продовжити?

source: Installation completed
uk_ua: Установку завершено

source: Installing {{version}}
uk_ua: Встановлення {{version}}

source: Internet connection required
uk_ua: Потрібне підключення до Інтернету

source: Invalid <i>Pull-up</i> connection:<br>Block already connected
uk_ua: Неправильне підключення <i>Pull-up</i>:<br>Блок вже підключений

source: Invalid <i>Pull-up</i> connection:<br>Only <i>Input</i> blocks allowed
uk_ua: Неправильне підключення <i>Pull-up</i>:<br>Дозволені лише блоки <i>Input</i>

source: Invalid block connection:<br><i>Pull-up</i> already connected
uk_ua: Неправильне підключення блоку:<br><i>Pull-up</i> вже підключений

source: Invalid collection {{name}}
uk_ua: Неправильна колекція {{name}}

source: Invalid connection
uk_ua: Неправильне підключення

source: Invalid connection: {{a}} → {{b}}
uk_ua: Неправильне підключення: {{a}} → {{b}}

source: Invalid multiple input connections
uk_ua: Неправильне підключення декількох входів

source: Invalid new name!
uk_ua: Неправильне нове ім'я!

source: Invalid project format
uk_ua: Неправильний формат проекту

source: Invalid search name!
uk_ua: Неправильне ім'я для пошуку!

source: Italian
uk_ua: Італійська

source: Japanese
uk_ua: Японська

source: Korean
uk_ua: Корейська

source: Label finder
uk_ua: Пошук міток

source: Label updated
uk_ua: Мітку оновлено

source: Language
uk_ua: Мова

source: Light
uk_ua: Світла

source: Light Gray
uk_ua: Світло-сірий

source: Light Sea Green
uk_ua: Світло-морський зелений

source: Load
uk_ua: Завантажити

source: Local parameter
uk_ua: Локальний параметр

source: Logging enabled
uk_ua: Журналювання увімкнено

source: Logging file
uk_ua: Файл журналювання

source: Logging file updated
uk_ua: Файл журналювання оновлено

source: Maximum bus size: 96 bits
uk_ua: Максимальний розмір шини: 96 біт

source: Medium Violet Red
uk_ua: Середній фіолетово-червоний

source: Memory
uk_ua: Пам'ять

source: Memory block names
uk_ua: Назви блоків пам'яті

source: Name
uk_ua: Ім'я

source: Names of the paired labels
uk_ua: Назви парних міток

source: Navy
uk_ua: Темно-синій

source: New
uk_ua: Новий

source: New Color:
uk_ua: Новий колір:

source: New Name:
uk_ua: Нове ім'я:

source: Next
uk_ua: Далі

source: No collections stored
uk_ua: Колекції не збережені

source: OK
uk_ua: ОК

source: Olive Drab
uk_ua: Оливковий зелений

source: Open
uk_ua: Відкрити

source: Open SVG
uk_ua: Відкрити SVG

source: Orange Red
uk_ua: Помаранчево-червоний

source: Original file {{file}} does not exist
uk_ua: Оригінальний файл {{file}} не існує

source: Output
uk_ua: Вихід

source: Output label
uk_ua: Вихідна мітка

source: Output labels
uk_ua: Вихідні мітки

source: Output port names
uk_ua: Назви вихідних портів

source: Output ports
uk_ua: Вихідні порти

source: Paired labels
uk_ua: Парні мітки

source: Paste
uk_ua: Вставити

source: Path {{path}} does not exist
uk_ua: Шлях {{path}} не існує

source: Please run: {{cmd}}
uk_ua: Будь ласка, виконайте: {{cmd}}

source: Preferences
uk_ua: Налаштування

source: Prev.
uk_ua: Назад

source: Project information
uk_ua: Інформація про проект

source: Project information updated
uk_ua: Інформацію про проект оновлено

source: Project {{name}} loaded
uk_ua: Проект {{name}} завантажено

source: Project {{name}} saved
uk_ua: Проект {{name}} збережено

source: Python environment
uk_ua: Середовище Python

source: Python environment updated
uk_ua: Середовище Python оновлено

source: Quit
uk_ua: Вийти

source: Red
uk_ua: Червоний

source: Redo
uk_ua: Повторити

source: Release History WIKI
uk_ua: Історія випусків WIKI

source: Reload
uk_ua: Перезавантажити

source: Remote host {{name}} not connected
uk_ua: Віддалений хост {{name}} не підключено

source: Remote hostname
uk_ua: Віддалене ім'я хоста

source: Remove
uk_ua: Видалити

source: Remove all
uk_ua: Видалити все

source: Replace All
uk_ua: Замінити все

source: Replace One
uk_ua: Замінити одне

source: Reset SVG
uk_ua: Скинути SVG

source: Royal Blue
uk_ua: Королівський синій

source: Russian
uk_ua: Російська

source: Save
uk_ua: Зберегти

source: Save SVG
uk_ua: Зберегти SVG

source: Save as
uk_ua: Зберегти як

source: Save submodule
uk_ua: Зберегти субмодуль

source: Select
uk_ua: Вибрати

source: Select all
uk_ua: Вибрати все

source: Select your board
uk_ua: Виберіть вашу плату

source: Show clock
uk_ua: Показати годинник

source: Slate Blue
uk_ua: Сланцево-синій

source: Source code
uk_ua: Вихідний код

source: Spanish
uk_ua: Іспанська

source: Spring Green
uk_ua: Яскраво-зелений

source: Start build
uk_ua: Розпочати збірку

source: Start upload
uk_ua: Розпочати завантаження

source: Start verification
uk_ua: Розпочати перевірку

source: Steel Blue
uk_ua: Сталевий синій

source: Synchronize remote files ...
uk_ua: Синхронізувати віддалені файли ...

source: System info
uk_ua: Системна інформація

source: Taiwanese
uk_ua: Тайванська

source: Testbench
uk_ua: Тестовий стенд

source: The collection {{name}} already exists.
uk_ua: Колекція {{name}} вже існує.

source: The current FPGA I/O configuration will be lost. Do you want to change to the {{name}} board?
uk_ua: Поточну конфігурацію FPGA I/O буде втрачено. Хочете змінити на плату {{name}}?

source: The toolchain will be removed. Do you want to continue?
uk_ua: Інструмент розробки буде видалено. Хочете продовжити?

source: There is a new nightly version available
uk_ua: Доступна нова нічна версія

source: There is a new stable version available
uk_ua: Доступна нова стабільна версія

source: This import operation requires a project path. You need to save the current project. Do you want to continue?
uk_ua: Ця операція імпорту вимагає шляху до проекту. Необхідно зберегти поточний проект. Хочете продовжити?

source: This project is designed for the {{name}} board.
uk_ua: Цей проект призначений для плати {{name}}.

source: This time
uk_ua: Цього разу

source: To enter "edit mode" in a deeper block, you need to finish the current level by locking the padlock.
uk_ua: Щоб увійти в "режим редагування" у глибшому блоці, потрібно завершити поточний рівень, заблокувавши замок.

source: To navigate through the design, you need to close "edit mode".
uk_ua: Щоб навігувати через дизайн, потрібно закрити "режим редагування".

source: To save your design you need to lock the padlock and go to the top-level design.<br><br>If you want to export this submodule to a file, use the "Save as" command.
uk_ua: Щоб зберегти свій дизайн, потрібно заблокувати замок і перейти до дизайну найвищого рівня.<br><br>Якщо ви хочете експортувати цей субмодуль у файл, використовуйте команду "Зберегти як".

source: Toolbox
uk_ua: Набір інструментів

source: Toolchain
uk_ua: Інструменти розробки

source: Toolchain installed
uk_ua: Інструменти розробки встановлено

source: Toolchain not installed
uk_ua: Інструменти розробки не встановлено

source: Toolchain removed
uk_ua: Інструменти розробки видалено

source: Toolchain version does not match
uk_ua: Версія інструменту розробки не збігається

source: Tools
uk_ua: Інструменти

source: Tri-state (aka high-Z, bidirectional, or inout) ports are not recommended in standard designs.<br /><br />You will be asked to update your Preferences (Advanced user setting) or you can just open this design on a preview basis.<br /><br />Continue?
uk_ua: Тристабільні (також відомі як high-Z, двонаправлені або вхід-вихідні) порти не рекомендовані в стандартних дизайнах.<br /><br />Вас попросять оновити налаштування (Налаштування для досвідчених користувачів) або ви можете просто відкрити цей дизайн для попереднього перегляду.<br /><br />Продовжити?

source: Tri-state connections (inout ports) disabled
uk_ua: Тристабільні з'єднання (вхід-вихідні порти) відключені

source: Tri-state connections (inout ports) enabled
uk_ua: Тристабільні з'єднання (вхід-вихідні порти) увімкнені

source: Turkish
uk_ua: Турецька

source: Turquoise
uk_ua: Бірюзовий

source: UI theme
uk_ua: Тема інтерфейсу

source: Undo
uk_ua: Скасувати

source: Unknown board
uk_ua: Невідома плата

source: Unsupported project format {{version}}
uk_ua: Непідтримуваний формат проекту {{version}}

source: Untitled
uk_ua: Без назви

source: Update (Latest stable)
uk_ua: Оновлення (остання стабільна версія)

source: Upload
uk_ua: Завантажити

source: Upload done
uk_ua: Завантаження завершено

source: Using external Apio: {{name}}
uk_ua: Використання зовнішнього Apio: {{name}}

source: Verification done
uk_ua: Перевірка завершена

source: Verify
uk_ua: Перевірити

source: Version
uk_ua: Версія

source: Version notes
uk_ua: Примітки до версії

source: View
uk_ua: Перегляд

source: View license
uk_ua: Переглянути ліцензію

source: Viewing tri-state
uk_ua: Перегляд тристабільного стану

source: Warnings detected in the design
uk_ua: Попередження виявлені в дизайні

source: Welcome to Icestudio!
uk_ua: Ласкаво просимо до Icestudio!

source: Wrong block format: {{type}}
uk_ua: Неправильний формат блоку: {{type}}

source: Wrong block name {{name}}
uk_ua: Неправильна назва блоку: {{name}}

source: Wrong project format: {{name}}
uk_ua: Неправильний формат проекту: {{name}}

source: Wrong remote hostname {{name}}
uk_ua: Неправильне віддалене ім'я хоста: {{name}}

source: Yellow
uk_ua: Жовтий

source: Yes
uk_ua: Так

source: You are editing a submodule, so you will save just this submodule ("Save as" works like "Export module"). Do you want to continue?
uk_ua: Ви редагуєте субмодуль, тому збережете лише цей субмодуль ("Зберегти як" працює як "Експортувати модуль"). Хочете продовжити?

source: You are importing a block that uses "tri-state".
uk_ua: Ви імпортуєте блок, який використовує "тристабільний стан".

source: You are loading a design that uses "tri-state".
uk_ua: Ви завантажуєте дизайн, який використовує "тристабільний стан".

source: You are navigating into the design: If you want to save the entire design, you need to go back to the top-level. If you want to export this module as new file, unlock the module and use "Save as".
uk_ua: Ви навігуєте по дизайну: якщо хочете зберегти весь дизайн, потрібно повернутися до верхнього рівня. Якщо хочете експортувати цей модуль як новий файл, розблокуйте модуль і використовуйте "Зберегти як".

source: You can load it as it is or convert it to use the {{name}} board.
uk_ua: Ви можете завантажити його як є або конвертувати для використання з платою {{name}}.

source: You can only build at the top-level design. Inside submodules, you can <strong>Verify</strong>
uk_ua: Ви можете збирати тільки на верхньому рівні дизайну. Усередині субмодулів, ви можете <strong>Перевірити</strong>

source: You can only upload at the top-level design. Inside submodules, you can <strong>Verify</strong>
uk_ua: Ви можете завантажувати тільки на верхньому рівні дизайну. Усередині субмодулів, ви можете <strong>Перевірити</strong>

source: You can read the release notes on the
uk_ua: Ви можете прочитати примітки до версії на

source: Your changes will be lost if you don’t save them
uk_ua: Ваші зміни будуть втрачені, якщо ви їх не збережете

source: back
uk_ua: назад

source: {{app}} is required.
uk_ua: {{app}} необхідний.

source: {{board}} datasheet not defined
uk_ua: {{board}} технічний опис не визначено

source: {{board}} pinout not defined
uk_ua: {{board}} розташування контактів не визначено

source: {{board}} rules not defined
uk_ua: {{board}} правила не визначено

source: {{name}} exported
uk_ua: {{name}} експортовано
